Repository: luan-u/tvt-br-translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: pt_br

source: Common solutions (which often cause a {{Wishplosion}}) are: # Ask the devil for something he can't do (like worship God) or that destroys him, which makes the entire deal pointless.
pt_br: Soluções comuns são: # Pedir do diabo algo que ele não pode fazer (como adorar a Deus) ou que o destrua, o que torna o trato sem sentido.

source: Common symptoms of Sequelitis -- the elements that contribute to the sequel not being as well-received as the original -- can include, but are not limited to:
pt_br: Sintomas comuns de sequelite -- os elementos que contribuem para a sequência não ser tão bem-recebida quanto o original -- incluem (mas não se limitam a):

source: Common traits and subdivisions of the Big Guy include: * Class 1: The typical tough guy.
pt_br: Traços e subdivisões do Grandão incluem: * Classe 1: O durão típico.

source: Commonly elicits a response along the lines of "that's not what's wrong here".
pt_br: Costumeiramente provoca uma resposta no sentido de "não é isso que está errado aqui".

source: Commonly seen in FluffyCloudHeaven.
pt_br: Comumente vistas no Br/CeuDeNuvensFofas.

source: Compare ActuallyPrettyFunny, when even the target of the joke concedes the humor of the situation.
pt_br: Comparar com Br/NaVerdadeFoiEngracado, quando até o alvo da piada reconhece o humor da situação.

source: Compare AlternativeJokeInterpretation, AreYouPonderingWhatImPondering, BadNewsInAGoodWay, BaitAndSwitchComment, {{Cloudcuckoolander}}, TheDitz, FailedASpotCheck, InsaneTrollLogic (logic that consists of comically missing the point), ITakeOffenseToThatLastOne, MistakenForProfound, NeedAHandOrAHandjob, NotActuallyTheUltimateQuestion, ProportionalArticleImportance, RightForTheWrongReasons, SidetrackedByTheAnalogy, and SkewedPriorities.
pt_br: Comparar com Br/InterpretacaoAlternativaDePiada, Br/VoceEstaPensandoNoQueEstouPensando, Br/MasNoticiasDeUmJeitoBom, Br/ComentarioDeIscaETroca, Br/OLunatico, Br/OIdiota, Br/FalhouNoTesteDePercepcao, Br/LogicaTrollInsana (lógica que consiste em comicamente perder o ponto), Br/EsseUltimoMeOfendeu, Br/ConfundidoComAlgoProfundo, Br/NaVerdadeNaoEAPerguntaDefinitiva, Br/ImportanciaProporcionalAoArtigo, Br/CertoPelosMotivosErrados, Br/DistraidoPelaAnalogia e Br/PrioridadesDistorcidas.

source: Compare BargainWithHeaven, which this trope [[MorePopularSpinOff originated as an]] [[InvertedTrope Inversion]] of, but which is largely [[ForgottenTrope forgotten]] in the mainstream, but still very much in use in some contexts.
pt_br: Comparar Br/NegociarComOCeu, de onde esse tropo [[Br/DerivadoMaisPopular se originou como uma]] [[Br/TropoInvertido inversão]], mas que está [[Br/TropoEsquecido esquecido]] na mídia popular, apesar de usado em alguns contextos.

source: Compare ButtMonkey, for which a character ends up having many disproportionately bad things happen to them throughout the story (and may also technically qualify for this trope, as hard as that sounds).
pt_br: Comparar com Br/{{Corinho}}, em que um personagem sofre de maneira desproporcional ao longo da história (e, por mais difícil que pareça, pode até se encaixar neste tropo).

source: Compare ClockKing, who does the same thing with people's schedules instead of their emotions and/or minds.
pt_br: Comparar com Br/ReiRelogio, que faz a mesma coisa, só que com os compromissos e horários das pessoas ao invés de emoções e mentes.

source: Compare ContestedSequel (when there is considerable division about the sequel's quality), InNameOnly (when a sequel is strangely divergent from its predecessor), VillainBasedFranchise (when a sequel retains the monster or villain but features none of the original heroes) and CapcomSequelStagnation (Where it's the ''same'' game, with minor tweaks and additions, re-released over and over like string of mediocre sequels).
pt_br: Comparar com Br/SequenciaContestada (quando há divisão considerável sobre a qualidade da sequência), Br/SomenteNoNome (quando uma sequência é estranhamente divergente do predecessor), Br/FranquiaBaseadaEmViloes (quando uma sequência mantém o monstro ou vilão, mas nenhum dos heróis originais) e Br/EstagnacaoDeSequenciaDaCapcom (quando é o ''mesmo'' jogo, com pequenos ajustes e acréscimos, re-lançado repetidas vezes).

source: Compare CreateYourOwnVillain, WhatTheHellHero, UnwittingInstigatorOfDoom, UnwittingPawn, MustMakeAmends, YouAlreadyChangedThePast, TwoRightsMakeAWrong, NiceJobFixingItVillain (but note that villains are also subject to ''this'' trope — they can do something careless that screws them over or helps out a ''worse'' villain).
pt_br: Comparar com Br/CriarOSeuProprioVilao, Br/QueMerdaEEssaHeroi, Br/InstigadorInvoluntarioDoCaos, Br/PeaoInvoluntario, Br/DevoMeRedimir, Br/VoceJaMudouOPassado, Br/DoisAcertosCausamUmErro e Br/BomTrabalhoConsertandoTudoVilao (mas note que os vilões também são sujeitos a ''este'' tropo -- eles podem fazer algo descuidado que auxilia um vilão ''pior'').

source: Compare ExactWords, NoManOfWomanBorn, PuzzleThriller.
pt_br: Comparar com Br/PalavrasExatas, Br/NinguemNascidoDeMulher e Br/SuspenseEnigmatico.

source: Compare ExternalRetcon, where the audience is expected to be familiar with an entire ''existing'' story.
pt_br: Comparar com Br/RetconExterno, onde espera-se que o público seja familiarizado com uma história ''já existente''.

source: Compare FencePainting when this technique is used by a character in-universe to draw people's attention to otherwise boring actions.
pt_br: Comparar com Br/PintarACerca quando essa técnica é usada in-universo por um personagem para trazer atenção à atividades comumente chatas.

source: Compare FlipFlopOfGod.
pt_br: Comparar com Br/IndecisaoDeDeus.

source: Compare FluffyTheTerrible, TomTheDarkLord, and JustTheFirstCitizen, where the name fails to describe the nastiness, and DeathbringerTheAdorable, where the nastiness fails to live up to the name.
pt_br: Comparar com Br/FofuchoOTerrivel, Br/TomOSenhorDasTrevas e Br/ApenasOPrimeiroCidadao, quando o nome não transmite toda a maldade, e Br/MortiferoOAdoravel, quando o nível de maldade não combina com o nome.

source: Compare FridgeLogic.
pt_br: Comparar com Br/LogicaDeGeladeira.

source: Compare GoodBadTranslation.
pt_br: Comparar com Br/TraducaoRuimBoa.

source: Compare GuileHero, its GoodCounterpart.
pt_br: Comparar com Br/HeroiAstuto, a sua Br/ContraparteDoBem.

source: Compare HardDrinkingTropes for an extra classy evening.
pt_br: Comparar com Br/TroposDeBebedeira para uma noite extra luxuosa.

source: Compare HotBlooded, in which the character may have such tendencies but in a less threatening way (even if both could overlap).
pt_br: Comparar Br/SangueQuente, onde o personagem tem essas tendências de um jeito menos ameaçador (apesar de haverem pontos em comum).

source: Compare LocalReference.
pt_br: Comparar Br/ReferenciaLocal.

source: Compare LowestCommonDenominator.
pt_br: Comparar com Br/MinimoDivisorComum.

source: Compare NegativeContinuity.
pt_br: Comparar Br/ContinuidadeNegativa.

source: Compare PokeThePoodle, SkewedPriorities, AllCrimesAreEqual, JaywalkingWillRuinYourLife (when the minor crime carries significant consequences) and WorstNewsJudgementEver (where jaywalking is the main headline over arson and murder).
pt_br: Comparar com Br/CutucarOPoodle, Br/PrioridadesDistorcidas, Br/TodosOsCrimesSaoIguais, Br/AtravessarForaDaFaixaVaiArruinarSuaVida (quando a infração menor causa grandes consequências) e Br/PessimaPrioridadeDeNoticias (quando atravessar fora da faixa é a manchete principal ao invés do roubo e do assassinato).

source: Compare SchrodingersCanon, where a work's status as canonical has yet to be determined, and RetCanon, where something that was intended as non-canonical becomes canonical.
pt_br: Comparar com Br/CanoneDeSchrodinger, onde a situação de uma obra como canônica ainda precisa ser determinada, e Br/RetCanone, onde algo que foi pensado como não canônico se torna parte do cânone.

source: Compare TemporarilyExaggeratedTrait, which is like flanderization but only done temporarily.
pt_br: Comparar com Br/AspectoTemporariamenteExagerado, que é como a flanderização mas feito apenas temporariamente.

source: Compare TheCavalry (it's the heroes saved in the nick of time), ContrivedCoincidence, BadGuysDoTheDirtyWork (otherwise known as Big Damn Villains), VillainousRescue (when the villains are like this trope) and HellYesMoment.
pt_br: Comparar com Br/ACavalaria, Br/CoincidenciaConveniente, Br/AlguemTemQueFazerOTrabalhoSujo e Br/ResgateVilanico.

source: Compare TheNeedsOfTheMany, BotheringByTheBook, the LiteralGenie, GoneHorriblyRight, ExactWords and LoopholeAbuse.
pt_br: Comparar Br/AsNecessidadesDeMuitos, Br/GenioLiteral, Br/DeuHorrivelmenteCerto, Br/PalavrasExatas e Br/AbusoDasRegras.

source: Compare TheSnarkKnight, LittleMissSnarker, {{Cuckoosnarker}}, WeaselMascot, FirstPersonSmartass, ServileSnarker, GentlemanSnarker, SilentSnarker, DisabledSnarker, MentorInSourArmor.
pt_br: Comparar com Br/CavaleiroSarcastico, ??? LittleMissSnarker, ??? {{Cuckoosnarker}}, ??? WeaselMascot, Br/EngracadinhoEmPrimeiraPessoa, Br/SarcasticoServil, Br/SarcasticoCavalheiro, Br/SarcasticoSilencioso, Br/SarcasticoPCD e ??? MentorInSourArmor.

source: Compare TragicMistake.
pt_br: Comparar com Br/ErroTragico.

source: Compare TwoRightsMakeAWrong and AbileneParadox, when a group decides upon a course of action that none of the individual members actually want to do because they think the others want it.
pt_br: Comparar com Br/DoisAcertosCausamUmErro e Br/ParadoxoDeAbilene, quando um grupo decide em um plano de ação que nenhum dos membros individualmente quer fazer, mas sob a impressão de que os outros querem.

source: Compare VanillaUnit for the playable equivalent of muggles.
pt_br: Comparar Br/UnidadePadrao para o equivalente jogável dos trouxas.

source: Compare WeWantOurJerkBack when the hero/villain makes the villain/hero powerless, only to have it backfire and give them a worse villain/hero/[[ArsonMurderAndJaywalking fate]] than expected, resulting in them wanting things to go back the way they were.
pt_br: Comparar com Br/QueremosNossoBabacaDeVolta para quando o herói/vilão consegue neutralizar o vilão/herói, mas isso dá errado e gera um vilão/herói/[[Br/RouboHomicidioEAtravessarForaDaFaixa destino]] pior do que o esperado, o que resulta nele querendo que as coisas voltem a ser como eram.

source: Compare WorldOfJerkass, a world which is only unpleasant because all of the characters are horrible people.
pt_br: Comparar com Br/MundoDeBabacas, um mundo que só é desagradável porque todos os personagens são pessoas horríveis.

source: Compare also ReasoningWithGod.
pt_br: Comparar também Br/ArgumentarComDeus.

source: Compare and contrast AliensInCardiff.
pt_br: Comparar e contrastar com Br/AliensEmCardiff.

source: Compare and contrast EarlyInstallmentWeirdness (as it applies to characters), with early depictions of a character being different from later ones simply because the producers hadn't figured out what role they should play in the story.
pt_br: Comparar e contrastar com ??? EarlyInstallmentWeirdness (conforme aplicado a personagens), com apresentações prévias de um personagem sendo diferentes das posteriores simplesmente porque os produtores não sabiam em qual papel eles deveriam se encaixar na história.

source: Compare and contrast MamaBear, PapaWolf, BigBrotherInstinct, and ViolentlyProtectiveGirlfriend, who may be capable of temporary Ax-Craziness when their kids, younger sibling(s) or mate are under threat, but are often played sympathetically.
pt_br: Comparar e contrastar Br/MamaeUrso, Br/PapaiLobo, Br/InstintoDeIrmaoMaisVelho e Br/NamoradaViolentamenteProtetora, que podem ser capazes de ficarem temporariamente doidos de pedra quando seus filhos, irmão mais novos ou parceiros estão em perigo, mas que geralmente são mostrados como simpáticos.

source: Compare and contrast with RayOfHopeEnding, where the villain prevails but not all is lost.
pt_br: Comparar e contrastar com Br/FinalRaioDeEsperanca, onde o vilão prevalece mas nem tudo está perdido.

source: Compare and contrast with its dramatic cousin, the WhamLine.
pt_br: Comparar e contrastar com o primo dramático, Br/AquelaFrase.

source: Compare and contrast with the KnightInSourArmor, who is what happens when a LawfulGood character [[ToBeLawfulOrGood chooses to err]] on the side of Good instead of erring towards Law; and ObliviouslyEvil, where the villain is so thoroughly convinced of their own righteousness that the idea that they're doing anything wrong doesn't even occur to them without external output, and upon having the consequences of their actions pointed out to them, will either make a HeelFaceTurn or become a Knight Templar and continue believing that their actions are right and the dissenter is wrong.
pt_br: Comparar e contrastar com ??? KnightInSourArmor, que é o que acontece quando um personagem Br/LealEBom [[Br/SerLealOuSerBom escolhe errar]] em favor do Bem ao invés de errar em favor da Lei; e ??? ObliviouslyEvil, onde o vilão está tão convencido de sua própria corretude que a ideia de que eles possam estar fazendo algo errado nem sequer lhes ocorre sem intervenção externa, e ao ter as consequências de seus atos apontadas a ele, pode Br/PassarParaOLadoDosMocinhos ou se tornar um Cavaleiro Templário e continuar com a crença de que suas ações são corretas e quem reclamou está errado.

source: Compare of course {{Immortality}}, for the ways in which characters cannot die.
pt_br: Comparar com Br/{{Imortalidade}}, para os meios em que os personagens não podem morrer.

source: Compare to RobotBuddy, AndroidsArePeopleToo, ClonesArePeopleToo, OurSoulsAreDifferent, AnimateInanimateObject, RidiculouslyHumanRobots, DeceptivelyHumanRobots, JustAMachine, EmptyShell, SoullessShell, CompanionCube, SlidingScaleOfRobotIntelligence, TuringTest, AlternativeTuringTest, ReligiousRobot, and RobotReligion.
pt_br: Comparar com Br/AmigoRobo, Br/AndroidesTambemSaoGente, Br/ClonesTambemSaoGente, Br/NossasAlmasSaoDiferentes, Br/ObjetoInanimadoAnimado, Br/RobosRidiculamenteHumanos, Br/RobosEnganosamenteHumanos, Br/SoUmaMaquina, Br/CascoVazio, Br/CascoSemAlma, Br/CuboCompanheiro, Br/EscalaMovelDeInteligenciaRobotica, Br/TesteDeTuring, Br/TesteAlternativoDeTuring, Br/RoboReligioso e Br/ReligiaoRobo.

source: Compare to TheWorfEffect (a strong character is defeated to show the enemy's strength), SacrificialLion (a strong and important character is killed to show the enemy's strength or seriousness), TheWorldsExpertOnGettingKilled, {{Retirony}}, MauveShirt, SacrificialLamb, DisposableSexWorker, AnyoneCanDie, LittleDeadRidingHood, CListFodder (who are pre-established named characters but are still much more disposable than main characters), AMillionIsAStatistic, and MonsterMunch.
pt_br: Comparar com Br/EfeitoWorf (um personagem forte é derrotado para demonstrar a força do inimigo), Br/LeaoDeSacrificio (um personagem forte e importante é morto para mostrar a força ou seriedade do inimigo), Br/OEspecialistaMundialEmSerMorto, Br/{{Aposentaironia}}, Br/CamisaLilas, Br/CordeiroDeSacrificio, Br/ProfissionalSexualDescartavel, Br/QualquerUmPodeMorrer, Br/BuchaDeClasseC (que são personagens pré-estabelecidos e com nomes, mas ainda assim muito mais descartáveis que os principais), Br/UmMilhaoEUmaEstatistica e Br/LancheDeMonstro.

source: Compare with BrainBleach (the character is afflicted by {{squick}}y mental images), BrainFever (the character is made ill by mental stress and trauma), DrivenToMadness (when this is deliberately inflicted by someone onto the character), MyGodWhatHaveIDone (the character is wracked with remorse), and MySkullRunnethOver (the character is overwhelmed by the sheer amount of information stuffed into his brain).
pt_br: Comparar com Br/AguaSanitariaCerebral (o personagem é afetado por imagens horríveis), Br/FebreCerebral (o personagem fica doente por causa do estresse e trauma mentais), Br/LevadoALoucura (quando isso é deliberadamente causado no personagem por alguém) e Br/MeuDeusOQueFoiQueEuFiz (o personagem fica arrasado com remorso).

source: Compare with DoomMagnet.
pt_br: Comparar com Br/ImaDeCaos.

source: Compare with PyrrhicVictory, where the day is carried, but the cost of winning is crippling to the victors.
pt_br: Comparar com Br/VitoriaPirrica, onde o dia é vencido mas o custo da vitória é muito danoso aos vitoriosos.

source: Compare with VarietyShow.
pt_br: Comparar com Br/ProgramaDeVariedades.

source: Compare {{Backstory}}, {{Flashback}} and {{Interquel}}.
pt_br: Comparar com Br/HistoriaDeFundo, Br/{{Recordacao}} e Br/{{Interquencia}}.

source: Compare {{Bowdlerise}} (where a work is edited to remove material that can be considered questionable), {{Disneyfication}} (making a story more suitable for children by toning down the darker elements), MenaceDecay (where a bratty child character becomes less of a troublemaker over time), BadassDecay (where audiences see a cool character as becoming not as impressive and formidable as they used to be), ReverseCerebusSyndrome (where an initially dark work becomes lighter in tone over time), SugarWiki/{{WAFF}} (when a work's whole purpose is to appeal to the audience by being cute and endearing), AdaptationalAngstDowngrade (where an adaptation changes a character's backstory to remove the tragic parts), TamerAndChaster (where a work reduces the amount of nudity and sexual content) and PacifiedAdaptation (where the adaptation has less violence).
pt_br: Comparar com ??? {{Bowdlerise}} (quando uma obra é editada para remover material que pode ser considerado questionável, Br/{{Disneyficacao}} (tornar uma história mais apropriada para crianças ao atenuar os elementos mais pesados), ??? MenaceDecay (onde uma criança problemática se torna menos problemática com o tempo), Br/DecaimentoDoFodao (onde o público percebe um personagem maneiro como não sendo tão impressionante e formidável quanto costumavam ser), ??? ReverseCerebusSyndrome (uma obra inicialmente séria se torna mais leve com o tempo), ??? AdaptationalAngstDowngrade (uma adaptação muda a história de fundo de um personagem para remover os elementos trágicos), Br/MaisMansoECasto (quando uma obra reduz a quantidade de nudez e conteúdo sexual) e Br/AdaptacaoPacificada (quando a adaptação possui menos violência).

source: Compare {{Newspeak}}.
pt_br: Comparar com Br/{{Novilingua}}.

source: Compare/contrast Administrivia/NoTropeIsTooCommon.
pt_br: Comparar/contrastar BrAdministrivia/NenhumTropoEComumDemais.

source: Compare/contrast KnightErrant.
pt_br: omparar/contrastar Br/CavaleiroErrante.

source: Complete with Clotilde the witch brewing a potion inside, and using a Don Ramón doll in it (maybe to represent the real one), much to Chilindrina's horror.
pt_br: Inclui até mesmo a Clotilde preparando uma poção em um caldeirão e usando um boneco do Seu Madruga (possivelmente como representação do Seu Madruga real), para horror da Chiquinha.

source: Confronting a Creature From Beyond The Stars or a Thing That Should Not Exist will lead either to psychological regression into denial, or insanity when the cognitive dissonance becomes too great.
pt_br: Enfrentar uma Criatura de Além das Estrelas ou uma Coisa Que Não Deveria Existir levará à regressão psicológica para a negação ou para a insanidade quando a dissonância cognitiva ficar excessiva.

source: Contrary to what some believe, Chaotic Evil does not have to mean wanton, meaningless slaughter and destruction.
pt_br: Ao contrário do que alguns acreditam, o tipo Caótico e Mau não necessariamente significa matança e destruição exageradas e desnecessárias.

source: Contrast DarkerAndEdgier (where a work is changed to be darker and more serious in tone), BloodierAndGorier (where the work features more graphic violence than usual), CerebusSyndrome (where a work defaults to becoming darker in tone over time), AdaptationalAngstUpgrade (where an adaptation alters a character's history so their life is more miserable than it was in the source material) and HotterAndSexier (where a work increases the amount of nudity and sexual content).
pt_br: Contrastar com Br/MaisSombrioEPesado (quando uma obra é alterada para receber um tom mais pesado e sério), Br/MaisSangrentoEGrotesco (quando a obra apresenta mais violência e detalhes gráficos que o usual), Br/SindromeDeCerebus (onde uma obra vai se tornando mais séria ao longo do tempo), ??? AdaptationalAngstUpgrade (onde uma adaptação altera a história do personagem para que sua vida passe a ser mais miserável do que antes) e Br/MaisAtraenteESexy (onde uma obra aumenta a quantidade de nudez e conteúdo sexual).

source: Contrast EvilTropes and NeutralityIndex.
pt_br: Contrastar com Br/TroposDoMal e Br/IndiceDeNeutralidade.

source: Contrast GoodIsNotNice for when a character is genuinely on the side of good but may rub other characters or the audience the wrong way.
pt_br: Contrastar Br/BomNaoEGentil para quando um personagem está genuinamente do lado do bem mas pode passar a impressão errada para outros personagens ou para o público.

source: Contrast GrowingTheBeard, when a show gets ''better'' over time (though they may sometimes overlap.
pt_br: Contrastar com Br/CrescerABarba, quando um show fica ''melhor'' com o tempo (apesar de haver sobreposição às vezes.

source: Contrast MadeOfIron, where no explanation is given for an individual's incredible resilience.
pt_br: Contrastar com Br/FeitoDeFerro, onde nenhuma explicação é dada para a resiliência incrível de um indivíduo.

source: Contrast MoreDakka and its related tropes, where more cooks are seen to make the soup better in any case.
pt_br: Contrastar Br/DescarregandoOPente e tropos relacionados, onde mais cozinheiros conseguem tornar a sopa melhor em qualquer situação.

source: Contrast NamesToTrustImmediately.
pt_br: Contrastar com Br/NomesParaConfiarImediatamente.

source: Contrast PlotArmor and RedHerringShirt.
pt_br: Contrastar com Br/ArmaduraDeTrama e Br/CamisaAvermelhada.

source: Contrast ProtagonistJourneyToVillain and RedemptionFailure.
pt_br: Contrastar com Br/JornadaDoProtagonistaParaVilao e Br/FalhaNaRedencao.

source: Contrast SuicidalPacifism, when a character never, ever resorts to violence even if it is necessary; and ExtremeDoormat, when a character is a complete pushover unable to fight back.
pt_br: Contrastar Br/PacifismoSuicida, onde um personagem nunca, ''jamais'', recorre à violência mesmo quando necessário, e Br/CapachoExtremo, quando um personagem é um inepto incapaz de lutar.

source: Contrast ThePowerOfFriendship.
pt_br: Contrastar com Br/OPoderDaAmizade.

source: Contrast TheyChangedItNowItSucks and {{Macekre}}.
pt_br: Contrastar com Br/ElesMudaramPorIssoEUmaDroga e Br/{{Macekre}}.

source: Contrast UpbringingMakesTheHero.
pt_br: Contrastar com Br/AEducacaoFazOHeroi.

source: Contrast YouAreTooLate, NiceJobBreakingItHero, TheCavalryArrivesLate.
pt_br: Contrastar Br/VoceChegouTardeDemais, Br/BomTrabalhoEstragandoTudoHeroi e Br/ACavalariaChegaTarde.

source: Contrast YouAreTooLate, RememberedTooLate.
pt_br: Contrastar com Br/VoceChegouTardeDemais e Br/LembrouTardeDemais.

source: Contrast the aforementioned LaserGuidedKarma, when the villain's comeuppance hits at an incredibly opportune moment and is directly traceable to their transgression; KarmaHoudiniWarranty, when the comeuppance only happens in a sequel; and KarmicDeath, when the comeuppance leads to the villain's death.
pt_br: Contrastar com o previamente mencionado Br/KarmaGuiadoPorLaser, quando a punição do vilão chega em um momento incrivelmente oportuno e é diretamente rastreável para a transgressão; Br/GarantiaDoKarmaHoudini, quando a punição só acontece na sequência, e Br/MorteKarmica, quando a punição leva à morte do vilão.
